RIET/src/Documents/увПротоколТестирования/увПротоколТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>увПротоколТестирования</name>
  <posting>Deny</posting>
  <attributes>
    <name>ЗаявкаНаВыполнениеРабот</name>
    <type>
      <types>DocumentRef.увЗаявкаНаВыполнениеРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительЗаказчика</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительИсполнителя</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПотраченоВремени</name>
    <comment>в часах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СледующаяВстреча</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияТестирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛУРВ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТестирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.увСтатусПротоколаТестирования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Претензии</name>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>DocumentRef.увВопрос</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Enums/увСтатусПротоколаТестирования/увСтатусПротоколаТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>увСтатусПротоколаТестирования</name>
  <enumValues>
    <name>НетПретензий</name>
  </enumValues>
  <enumValues>
    <name>ОшибкиНеИсправлены</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/увПротоколТестирования/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ДОКУМЕНТА

// Процедура - обработчик события "ОбработкаЗаполнения" документа
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.увЗаявкаНаВыполнениеРабот") Тогда
		
		//Нумерация рассчитана на длину строкового номера документа заявки равную 5
		//если в заявке длина номера изменена то в ПТ нужно ставить длину равную 
		//ДлинаНомераЗаявки + 3
		
		ПоследнийНомер = 0;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПротоколТестирования.Номер,
		               |	ПротоколТестирования.ЗаявкаНаВыполнениеРабот
		               |ИЗ
		               |	Документ.увПротоколТестирования КАК ПротоколТестирования
		               |
		               |ГДЕ
		               |	ПротоколТестирования.ЗаявкаНаВыполнениеРабот = &Заявка";
		Запрос.УстановитьПараметр("Заявка", Основание);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаНомера = Выборка.Номер;
			НомерПТ = Число(Прав(СтрокаНомера,2));
			ПоследнийНомер = ?(НомерПТ > ПоследнийНомер, НомерПТ, ПоследнийНомер);
		КонецЦикла;
		ПоследнийНомер = (ПоследнийНомер+1);
		Если ПоследнийНомер < 10 Тогда
			Номер = Основание.Номер + "-0" + ПоследнийНомер;
		Иначе
			Номер = Основание.Номер + "-" + ПоследнийНомер;
		КонецЕсли;
		ЗаявкаНаВыполнениеРабот = Основание.Ссылка;
		ПредставительЗаказчика = Основание.ОтветственныйЗаВнедрениеОтЗаказчика;
		ПредставительИсполнителя = Основание.ОтветственныйЗаТестирование;
		Статус = Перечисления.увСтатусПротоколаТестирования.НетПретензий;
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью" документа
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда	
		Сообщить("Не заполнено поле: Дата");
		Отказ = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Номер) Тогда	
		Сообщить("Не заполнено поле: Номер");
		Отказ = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Статус) Тогда
		Отказ = Истина;
	ИначеЕсли Статус = Перечисления.увСтатусПротоколаТестирования.НетПретензий Тогда
		Если Не ЗначениеЗаполнено(ДатаЗакрытияТестирования) Тогда
			Сообщить("Не заполнено поле: Дата закрытия тестирования");
			Отказ = Истина; 
		КонецЕсли;
	Иначе 
		Если Не ЗначениеЗаполнено(СледующаяВстреча) Тогда
			Сообщить("Не заполнено поле: Следующая встреча");
			Отказ = Истина; 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
